import dogSize from "../../public/photo/dogSize.png";
import { Div, P, Section, Img, Ul, Li } from "../../styles/measurements.styled";

const Measurements = () => {
  return (
    <Section>
      <h2>Як зробити заміри?</h2>
      <Div>
        <Img alt="size for dog" src={dogSize} />
        <Ul>
          <Li>
            <b>Підготовка</b> : Перш ніж почати, забезпечте тихе та спокійне
            оточуюче середовище. Виставте улюбленця в стійку. Якщо вимірювати
            лежачи aбо сидячи - розмір може не підійти. Заміри проводити лише
            сантиметровою стрічкою!
          </Li>
          <Li>
            <b>Вимірювання довжини спини (A)</b> : Виміряйте від основи шиї (де
            вона зустрічається з плечима. Там де ошийник) до основи
            хвоста(підніміть хвостик, щоб побачити, де кінець спинки).
          </Li>
          <Li>
            <b>Вимірювання обхвату грудей(B)</b> : Оберніть стрічку навколо
            грудей собаки під передніми лапами, де найбільший виступ грудної.
            Переконайтеся, що стрічка не стягнута надто сильно, але і не
            залишається зайвого простору.
          </Li>
          <Li>
            <b>Вимірювання обхвату шиї (C)</b> : Оберніть стрічку навколо шиї
            улюбленця там, де розташований ошийник.
          </Li>
        </Ul>
      </Div>
      <P>
        Для індивідуального пошиття напишіть нам в будь-який меседнджер , щоб
        менеджер надіслав таблицю для детальних вимірів.
      </P>
    </Section>
  );
};

export default Measurements;
